; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	thermograph2 - mode
	thermograph0 - mode
	image1 - mode
	Star3 - direction
	Star6 - direction
	Star8 - direction
	Star1 - direction
	GroundStation4 - direction
	Star11 - direction
	GroundStation7 - direction
	GroundStation9 - direction
	Star5 - direction
	Star0 - direction
	GroundStation2 - direction
	Star12 - direction
	GroundStation10 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star1)
	(supports instrument1 image1)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument2 thermograph2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star12)
	(supports instrument3 thermograph2)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star12)
	(calibration_target instrument3 GroundStation9)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 GroundStation7)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet17)
	(supports instrument5 thermograph2)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation10)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star12)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation10)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star8)
)
(:goal (and
	(pointing satellite0 Star8)
	(pointing satellite1 Star15)
	(pointing satellite2 Star0)
	(have_image Planet13 thermograph0)
	(have_image Star14 thermograph0)
	(have_image Star15 thermograph2)
	(have_image Phenomenon16 thermograph0)
	(have_image Planet17 thermograph0)
))

)

; plan
1. (turn_to satellite2 star0 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star0)
   goals met: 1 of 8
2. (turn_to satellite1 groundstation10 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 groundstation10)
   goals met: 1 of 8
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 8
4. (calibrate satellite1 instrument3 groundstation10)
   added: (calibrated instrument3)
   goals met: 1 of 8
5. (turn_to satellite1 planet13 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 planet13)
   goals met: 1 of 8
6. (take_image satellite1 planet13 instrument3 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 2 of 8
7. (turn_to satellite1 phenomenon16 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon16)
   goals met: 2 of 8
8. (turn_to satellite0 star8 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star8)
   goals met: 3 of 8
9. (take_image satellite1 phenomenon16 instrument3 thermograph0)
   added: (have_image phenomenon16 thermograph0)
   goals met: 4 of 8
10. (turn_to satellite1 planet17 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet17)
   goals met: 4 of 8
11. (take_image satellite1 planet17 instrument3 thermograph0)
   added: (have_image planet17 thermograph0)
   goals met: 5 of 8
12. (turn_to satellite1 star14 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 star14)
   goals met: 5 of 8
13. (take_image satellite1 star14 instrument3 thermograph0)
   added: (have_image star14 thermograph0)
   goals met: 6 of 8
14. (turn_to satellite1 star15 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star15)
   goals met: 7 of 8
15. (take_image satellite1 star15 instrument3 thermograph2)
   added: (have_image star15 thermograph2)
   goals met: 8 of 8
